DataProcessors/ПечатьШКБольшихКоробок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПечатьШКБольшихКоробок</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ШтриховыеКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтриховыеКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛожныйШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыведенИзМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПечатьШКБольшихКоробок/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПечатьШК(Команда)
	ТД=ПечатьШКСервер();
	ТД.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьШКСервер() Экспорт
	
	ВнешняяКомпонента = Справочники.Номенклатура.ПодключитьВнешнююКомпонентуПечатиШтрихкода();
	Макет = Обработки.ПечатьШКБольшихКоробок.ПолучитьМакет("Этикетка");
	
	
	Область = Макет.ПолучитьОбласть("Этикетка");
	ОбластьСтр = Макет.ПолучитьОбласть("Строка");
	ТабДокИтог = Новый ТабличныйДокумент();
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Характеристика,
	               |	ТЗ.КоличествоКоробок
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтриховыеКоды.Номенклатура,
	               |	ШтриховыеКоды.Характеристика,
	               |	МАКСИМУМ(ШтриховыеКоды.ШтрихКод) КАК ШтрихКод,
	               |	вт.КоличествоКоробок
	               |ИЗ
	               |	РегистрСведений.ШтриховыеКоды КАК ШтриховыеКоды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО ШтриховыеКоды.Номенклатура = вт.Номенклатура
	               |			И ШтриховыеКоды.Характеристика = вт.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ШтриховыеКоды.Номенклатура,
	               |	ШтриховыеКоды.Характеристика,
	               |	вт.КоличествоКоробок";
	Запрос.УстановитьПараметр("ТЗ", Объект.Товары.Выгрузить());
	Выб=Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		
		ШтрихКод = "88" + Прав(Выб.Штрихкод,СтрДлина(Выб.Штрихкод)-2)+Строка(Формат(Выб.КоличествоКоробок, "ЧЦ=5; ЧВН=; ЧГ="));
		ТабДок = Новый ТабличныйДокумент();
		
		
		
		Рисунок 					= Область.Рисунки["ШтрихКод"];
		
		ПараметрыШК = Новый Структура();
		ПараметрыШК.Вставить("Ширина", Рисунок.Ширина);
		ПараметрыШК.Вставить("Высота", Рисунок.Высота);
		ПараметрыШК.Вставить("ТипКода", 4);
		ПараметрыШК.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШК.Вставить("РазмерШрифта", 10);
		ПараметрыШК.Вставить("Штрихкод", Штрихкод);
		Рисунок.Картинка = ОбщегоНазначенияКлиентСервер.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШК);
		Область.Параметры.ШК = ШтрихКод;
		ТабДок.Вывести(Область);
		ОбластьСтр.Параметры.Заполнить(Выб);
		ТабДок.Вывести(ОбластьСтр);
		Если ТабДокИтог.ПроверитьВывод(ТабДок) Тогда
			 ТабДокИтог.Вывести(ТабДок);
		Иначе
			 ТабДокИтог.ВывестиГоризонтальныйРазделительСтраниц();
			 ТабДокИтог.Вывести(ТабДок);
		КонецЕсли; 
	КонецЦикла; 
	
	ТабДокИтог.КлючПараметровПечати = "ПараметрыПечати_ЭтикеткиБольшихКоробок";
	Возврат ТабДокИтог;
	
КонецФункции
